###############################################################################
# Created by write_sdc
# Mon May 19 03:50:42 2025
###############################################################################
current_design sub_module16
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
